# [tap]

# -- Public clouds
tap "aws/tap"

# -- Google
tap "google/verible"

# -- Homebrew
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# -- Version control systems
tap "microsoft/git"

# [brew]

# -- Build tools
brew "cmake"

# -- Compression
brew "xz"

# -- Databases
brew "sqlite"
brew "berkeley-db"

# -- GNU Arm compilers
brew "gcc-arm-embedded"

# -- GNU tools
brew "autoconf"
brew "automake"
brew "binutils"
brew "bison"
brew "coreutils"
brew "gettext"
brew "libtool"
brew "moreutils"
brew "parallel"
brew "readline"
brew "stow"

# -- GNOME tools
brew "glib"
brew "atk"

# -- Language runtime managers
brew "asdf"

# -- On-shell utils.
brew "bat"

# -- Public clouds
brew "aws-google-auth"
brew "awscli"

# -- Python
brew "python@3.10"
brew "pillow"

# -- Shells
brew "tcl-tk"
brew "bash"

# -- Shell plugin managers
brew "sheldon"

# -- Miscellaneous (unorganizable)
brew "batik"
brew "bzip2"
brew "cairo"
brew "harfbuzz"
brew "libraqm"
brew "pkg-config"

# -- !Unorganized
brew "asn1c"
brew "bazel"
brew "ccache"
brew "ccat"
brew "cmake-docs"
brew "colordiff"
brew "cppcheck"
brew "cpputest"
brew "circleci"
brew "datamash"
brew "dfu-util"
brew "difftastic"
brew "direnv"
brew "djvu2pdf"
brew "docker"
brew "docker-clean"
brew "doxygen"
brew "dtc"
brew "eigen"
brew "exercism"
brew "guile"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "flatbuffers"
brew "flatcc"
brew "pango"
brew "fontforge"
brew "fop"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-lfs"
brew "gitlint"
brew "glog"
brew "glow"
brew "gnu-sed"
brew "graphviz"
brew "pinentry"
brew "gnupg"
brew "gobject-introspection"
brew "gperf"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "hadolint"
brew "haskell-stack"
brew "hub"
brew "hugo"
brew "shared-mime-info"
brew "libheif"
brew "libmodbus"
brew "imagemagick"
brew "llvm"
brew "include-what-you-use"
brew "iproute2mac"
brew "john"
brew "jq"
brew "libiconv"
brew "libmagic"
brew "libslirp"
brew "libzip"
brew "lrzsz"
brew "lsusb"
brew "lxc"
brew "kaitai-struct-compiler"
brew "mas"
brew "mercurial"
brew "minicom"
brew "minimal-racket"
brew "mosquitto"
brew "zlib"
brew "mysql-client"
brew "newsboat"
brew "nghttp2"
brew "ninja"
brew "nmap"
brew "node-build"
brew "nvi"
brew "open-ocd"
brew "openssl@3"
brew "pkcs11-helper"
brew "openvpn"
brew "p7zip"
brew "pandoc"
brew "peco"
brew "picocom"
brew "pinentry-mac"
brew "plantuml"
brew "platformio"
brew "poetry"
brew "poppler"
brew "pre-commit"
brew "protobuf"
brew "python-tabulate"
brew "qemu"
brew "qpdf"
brew "qt"
brew "qt@5"
brew "radare2"
brew "remake"
brew "rlwrap"
brew "ruby"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "shntool"
brew "srecord"
brew "starship"
brew "tig"
brew "tmux"
brew "tnftp"
brew "tree"
brew "u-boot-tools"
brew "uncrustify"
brew "verible"
brew "west"
brew "wget"
brew "x86_64-elf-gcc"
brew "yosys"
brew "zenity"
brew "aws/tap/aws-sam-cli"

# [cask]

cask "1password"
cask "appcleaner"
cask "dash"
cask "fantastical"
cask "fig"
cask "flux"
cask "deepl"
cask "docker"
cask "dotnet"
cask "ghdl"
cask "git-credential-manager-core"
cask "github"
cask "gitkraken"
cask "gitup"
cask "google-chrome"
cask "google-japanese-ime"
cask "insomnia"
cask "iterm2"
cask "latexit"
cask "miro"
cask "notion"
cask "openinterminal"
cask "openvpn-connect"
cask "session-manager-plugin"
cask "slack"
cask "visual-studio"
cask "visual-studio-code"
cask "vnc-viewer"
cask "zoom"

# -- Fonts
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-ricty-diminished"
cask "font-terminus"

# [mas]

mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Quiver", id: 866773894
mas "RunCat", id: 1429033973
mas "Sequel Ace", id: 1518036000

